# GenericImportOptions Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
GenericImportOptions Class
Members See Also
---
Generic Import options.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public abstract class GenericImportOptions
```

Visual Basic
---
```text
Public MustInherit Class GenericImportOptions
```

Visual C++
---
```text
public ref class GenericImportOptions abstract
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..GenericImportOptions
# See Also
GenericImportOptions Members
Autodesk.Revit.DB Namespace